package Board;

//# 기능11 : 상세보기 메뉴
//        - 설명 : 게시물 상세보기 화면에서는 다양한 작업을 할 수 있어야 합니다. 게시물의 수정과 삭제를 선택할 수 있어야 하며, 댓글을 달거나 좋아요/싫어요를 선택할 수 있는 등 많은 것을 할 수 있습니다. 먼저 상세보기화면에 들어왔을 때 실행할 수 있는 기능들을 메뉴화 해주세요.
//        - 입출력 예시
//        ```
//        명령어를 입력해주세요 : detail
//        상세보기 할 게시물 번호를 입력해주세요 : 1
//        ===== 1번 게시물 =====
//        번호 : 1
//        제목 : 안녕하세요 반갑습니다. 자바 공부중이에요.
//        내용 : 자바 너무 재밌어요!!
//        작성일 : 2023.06.09 11:19:23
//        조회수 : 1
//        ===================
//        상세보기 기능을 선택해주세요(1. 댓글 등록, 2. 추천, 3. 수정, 4. 삭제, 5. 목록으로) : 1
//        [댓글 기능]
//        상세보기 기능을 선택해주세요(1. 댓글 등록, 2. 추천, 3. 수정, 4. 삭제, 5. 목록으로) : 2
//        [추천 기능]
//        상세보기 기능을 선택해주세요(1. 댓글 등록, 2. 추천, 3. 수정, 4. 삭제, 5. 목록으로) : 1
//        [댓글 기능]
//        상세보기 기능을 선택해주세요(1. 댓글 등록, 2. 추천, 3. 수정, 4. 삭제, 5. 목록으로) : 5
//        명령어를 입력해주세요 :
//        ```

public class _11_ViewFucntion {
    public static void main(String[] args) {

    }
}
